{
  "projects": [
    {
      "title": "Clean Architecture Pattern",
      "description": "Constant exploration is a great way to discover new architectural patterns and stay current. This project follows the Clean Architecture Pattern, which has its foundation deep in SOLID Principles. It is a simple concept with numerous benefits, particulary for large scale applications.",
      "link": "https://github.com/khrystiian/Clean-architecture",
      "tools": [
        "C#",
        " .Net",
        " Web API",
        " Angular",
        " Elasticsearch",
        " SQL"
      ],
      "preview": [""]
    },
    {
      "title": "Chat Web App",
      "description": "This project arouse from of my curiosity about how a chat application works. Implemented during my studies free-time, it was really enjoyable time spend because I learned a lot about how to use SignalR.",
      "link": "https://github.com/khrystiian/SignalrChat",
      "tools": ["C#", " .Net", " SignalR", " SQL"],
      "preview": [""]
    },
    {
      "title": "Train Ticket Web App",
      "description": "Elasticsearch has been always a great approach to quickly retrieve data using flexible queries. This project addresses a full search using autocomplete on the Stackoverflow database. It proved fast and efficient, with several tweaking options to optimise the query.",
      "link": "https://github.com/khrystiian/Stackoverflow-search",
      "tools": [
        "C#",
        " .Net",
        " Web API",
        " Angular",
        " Elasticsearch",
        " SQL",
        " Maps"
      ],
      "preview": [""]
    },
    {
      "title": "Send messages using Rabbit MQ",
      "description": "Rabbit MQ is the most widely deployed open source message broker. It wouldn't be long before I got my hands on another free-time project, this time to investigate how messages are sent, queued then received.",
      "link": "https://github.com/khrystiian/RabbitMq-",
      "tools": ["Javascript", " C#", " .Net", " RabbitMQ", " SQL"],
      "preview": [""]
    },
    {
      "title": "Personal Website",
      "description": "A good practice exercising my passion for coding, and let the world know about it, was to make a copy of my Curriculum Vitae and deloy it live. Its completely front-end work, with JSON data and it uses Firebase hosting. Design and styling are not my strong suits, but I am well aware that practice is the only way to overcome them.",
      "link": "https://github.com/khrystiian/Curriculum-Vitae",
      "tools": ["Angular", " JSON", " HTML", " CSS"],
      "preview": [""]
    }
  ]
}
